Examinator/src/InformationRegisters/НастройкиТемОбщенияСУО/НастройкиТемОбщенияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиТемОбщенияСУО</name>
  <attributes>
    <name>ДатаПросмотра</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Архивирована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Помечена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тема</name>
    <type>
      <types>CatalogRef.ТемыСообщенийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/НастройкиТемОбщенияСУО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаписатьНастройки(Тема, ИмяРеквизита=Неопределено, Значение=Неопределено, Пользователь=Неопределено, ТекущаяДата=Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	Если ТекущаяДата = Неопределено Тогда
		ТекущаяДата  = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Записываем данные темы
	//
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НастройкиТемОбщенияСУО");
	ЭлементБлокировки.УстановитьЗначение("Тема", Тема);	
	ЭлементБлокировки.УстановитьЗначение("Пользователь", Пользователь);	
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	Блокировка.Заблокировать();
	
	НаборЗаписей = РегистрыСведений.НастройкиТемОбщенияСУО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Тема.Установить(Тема);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);

	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		Запись = НаборЗаписей.Добавить();
		
		Запись.Пользователь = Пользователь;
		Запись.Тема = Тема;
		
	Иначе
		
		Запись = НаборЗаписей[0];
		
	КонецЕсли;
		
	Если ИмяРеквизита <> Неопределено
		И Значение <> Неопределено Тогда 
	
		Если ТипЗнч(ИмяРеквизита) = Тип("Массив")
			И ТипЗнч(Значение) = Тип("Массив") Тогда
			
			Индекс = 0;
			Для каждого Элемент Из ИмяРеквизита Цикл
			
				Запись[Элемент] = Значение[Индекс];
				
				Индекс = Индекс + 1;
				
			КонецЦикла;
			
		Иначе
			
			Запись[ИмяРеквизита] = Значение;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Запись.ДатаПросмотра = ТекущаяДата;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецЕсли
